# Eleman İşlemleri

In [27]:
import pandas as pd
import numpy as np

In [30]:
s1 = np.random.randint(1,10, size=5)
s2 = np.random.randint(1,10, size=5)
s3 = np.random.randint(1,10, size=5)

In [31]:
# ndarray nesnelerini kullanarak sözlük oluşturalım.
sozluk={"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([1, 6, 1, 9, 4]),
 'var2': array([5, 2, 1, 7, 4]),
 'var3': array([9, 4, 6, 5, 3])}

In [32]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     5     9
1     6     2     4
2     1     1     6
3     9     7     5
4     4     4     3

In [33]:
df[0:1] # 0. satırdan 1.satıra(dahil değil) kadar

   var1  var2  var3
0     1     5     9

In [34]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
# indexleri yeniden isimlendirelim
df.index=["a","b","c","d","e"]

In [36]:
df

   var1  var2  var3
a     1     5     9
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

In [37]:
df["c":"e"] # e, dahil

   var1  var2  var3
c     1     1     6
d     9     7     5
e     4     4     3

### Silme

In [38]:
df.drop("a",axis=0) # a'yı sil, 0 ise satırı sil

   var1  var2  var3
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

In [39]:
df

   var1  var2  var3
a     1     5     9
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

In [40]:
df.drop("var1",axis=1) # var1'i sil, 1 ise sütunu sil

   var2  var3
a     5     9
b     2     4
c     1     6
d     7     5
e     4     3

In [41]:
# yaptığımız değişikliğin kalıcı olması için inplace argümanını True yapabiliriz
df.drop("a",axis=0, inplace=True)

In [42]:
df

   var1  var2  var3
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

### Fancy

In [43]:
l=["c","e"]

In [44]:
df.drop(l,axis=0)

   var1  var2  var3
b     6     2     4
d     9     7     5

### Değişkenler İçin

In [45]:
df

   var1  var2  var3
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

In [46]:
"var1" in df

True

In [47]:
l=["var1","var7","var2"]

In [48]:
for i in l:
    print(i in df)

True
False
True

In [49]:
df["var1"]

b    6
c    1
d    9
e    4
Name: var1, dtype: int64

### Değişken Oluşturalım

In [50]:
df["var7"]= df["var1"]/df["var2"]

In [51]:
df

   var1  var2  var3      var7
b     6     2     4  3.000000
c     1     1     6  1.000000
d     9     7     5  1.285714
e     4     4     3  1.000000

### Değişken Silmek

In [52]:
df.drop("var7",axis=1)

   var1  var2  var3
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

In [53]:
df

   var1  var2  var3      var7
b     6     2     4  3.000000
c     1     1     6  1.000000
d     9     7     5  1.285714
e     4     4     3  1.000000

In [54]:
df.drop("var7",axis=1,inplace=True)

In [55]:
df

   var1  var2  var3
b     6     2     4
c     1     1     6
d     9     7     5
e     4     4     3

### Fancy ile Silelim

In [56]:
l=["var1","var2"]

In [57]:
df.drop(l,axis=1)

   var3
b     4
c     6
d     5
e     3